dflhaishan/nuttx_os/boards/arm/stm32/stm32f103-alientek/src/stm32_lcd_5510.c
static inline void stm32f103_writegram(uint16_t rgbval)
{
  /* Write the value (GRAM register already selected) */
  stm32f103_writereg(LCD_REG_WRITE_GRAM, rgbval);
}

/****************************************************************************
 * Name:  stm32f103_readgram
 *
 * Description:
 *   Read one pixel from the GRAM memory
 *
 ****************************************************************************/

static inline uint16_t stm32f103_readgram(void)
{
  /* Write the value (GRAM register already selected) */
  uint16_t r = 0, g = 0, b = 0;
  LCD->address = LCD_REG_READ_GRAM;
  up_mdelay(2);
  r = LCD->value;
  up_mdelay(2);
  g = LCD->value;
  up_mdelay(2);
  b = LCD->value;

  return  (((r>>11)<<11)| ((g>>10)<<5) | (b>>11));
}

/****************************************************************************
 * Name:  stm32f103_setcursor
 *
 * Description:
 *   Set the cursor position.  In landscape mode, the "column" is actually
 *   the physical Y position and the "row" is the physical X position.
 *
 ****************************************************************************/

static void stm32f103_setcursor(uint16_t col, uint16_t row)
{
//   stm32f103_writereg(LCD_REG_CURSOR_X, row); /* GRAM horizontal address */
//   stm32f103_writereg(LCD_REG_CURSOR_Y, col); /* GRAM vertical address */
    LCD->address = LCD_REG_CURSOR_X;
    LCD->value = (row >> 8);
    LCD->address = LCD_REG_CURSOR_X + 1;
    LCD->value = (row & 0xff);
    LCD->address = LCD_REG_CURSOR_Y;
    LCD->value = (col >> 8);
    LCD->address = LCD_REG_CURSOR_Y + 1;
    LCD->value = (col & 0xff);  
}

/****************************************************************************
 * Name:  stm32f103_putrun
 *
 * Description:
 *   This method can be used to write a partial raster line to the LCD:
 *
 *   dev     - The lcd device
 *   row     - Starting row to write to (range: 0 <= row < yres)
 *   col     - Starting column to write to (range: 0 <= col <= xres-npixels)
 *   buffer  - The buffer containing the run to be written to the LCD
 *   npixels - The number of pixels to write to the LCD
 *             (range: 0 < npixels <= xres-col)
 *
 ****************************************************************************/

static int stm32f103_putrun(struct lcd_dev_s *dev,
                           fb_coord_t row, fb_coord_t col,
                           const uint8_t *buffer,
                           size_t npixels)
{
  const uint16_t *src = (const uint16_t *)buffer;
  int i;

  /* Buffer must be provided and aligned to a 16-bit address boundary */

  lcdinfo("row: %d col: %d npixels: %d\n", row, col, npixels);
  DEBUGASSERT(buffer && ((uintptr_t)buffer & 1) == 0);

  /* Write the run to GRAM. */

  /* Then write the GRAM data, manually incrementing Y (which is col) */

  for (i = 0; i < npixels; i++)
    {
      /* Write the next pixel to this position */

      stm32f103_setcursor(row, col);
      stm32f103_writegram(*src++);

      /* Increment to next column */

      col++;
    }


  return OK;
}

/****************************************************************************
 * Name:  stm32f103_getrun
 *
 * Description:
 *   This method can be used to read a partial raster line from the LCD:
 *
 *  dev     - The lcd device
 *  row     - Starting row to read from (range: 0 <= row < yres)
 *  col     - Starting column to read read (range: 0 <= col <= xres-npixels)
 *  buffer  - The buffer in which to return the run read from the LCD
 *  npixels - The number of pixels to read from the LCD
 *            (range: 0 < npixels <= xres-col)
 *
 ****************************************************************************/

static int stm32f103_getrun(struct lcd_dev_s *dev,
                           fb_coord_t row, fb_coord_t col,
                           uint8_t *buffer,
                           size_t npixels)
{
  uint16_t *dest = (uint16_t *)buffer;
  int i;

  /* Buffer must be provided and aligned to a 16-bit address boundary */

  lcdinfo("row: %d col: %d npixels: %d\n", row, col, npixels);
  DEBUGASSERT(buffer && ((uintptr_t)buffer & 1) == 0);

  /* Read the run from GRAM. */

  /* Then read the GRAM data, manually incrementing Y (which is col) */

  for (i = 0; i < npixels; i++)
    {
      /* Read the next pixel from this position */

      stm32f103_setcursor(row, col);
      *dest++ = stm32f103_readgram();

      /* Increment to next column */

      col++;
    }


  return OK;
}

/****************************************************************************
 * Name:  stm32f103_getvideoinfo
 *
 * Description:
 *   Get information about the LCD video controller configuration.
 *
 ****************************************************************************/

static int stm32f103_getvideoinfo(struct lcd_dev_s *dev,
                                 struct fb_videoinfo_s *vinfo)
{
  DEBUGASSERT(dev && vinfo);
  ginfo("fmt: %d xres: %d yres: %d nplanes: %d\n",
         g_videoinfo.fmt, g_videoinfo.xres,
         g_videoinfo.yres, g_videoinfo.nplanes);
  memcpy(vinfo, &g_videoinfo, sizeof(struct fb_videoinfo_s));
  return OK;
}

/****************************************************************************
 * Name:  stm32f103_getplaneinfo
 *
 * Description:
 *   Get information about the configuration of each LCD color plane.
 *
 ****************************************************************************/

static int stm32f103_getplaneinfo(struct lcd_dev_s *dev,
                                 unsigned int planeno,
                                 struct lcd_planeinfo_s *pinfo)
{
  DEBUGASSERT(dev && pinfo && planeno == 0);
  ginfo("planeno: %d bpp: %d\n", planeno, g_planeinfo.bpp);
  memcpy(pinfo, &g_planeinfo, sizeof(struct lcd_planeinfo_s));
  pinfo->dev = dev;
  return OK;
}

/****************************************************************************
 * Name:  stm32f103_getpower
 *
 * Description:
 *   Get the LCD panel power status (0: full off - CONFIG_LCD_MAXPOWER:
 *   full on). On backlit LCDs, this setting may correspond to the backlight
 *   setting.
 *
 ****************************************************************************/

static int stm32f103_getpower(struct lcd_dev_s *dev)
{
  ginfo("power: %d\n", 0);
  return g_lcddev.power;
}

/****************************************************************************
 * Name:  stm32f103_poweroff
 *
 * Description:
 *   Enable/disable LCD panel power (0: full off - CONFIG_LCD_MAXPOWER:
 *   full on). On backlit LCDs, this setting may correspond to the backlight
 *   setting.
 *
 ****************************************************************************/

static int stm32f103_poweroff(void)
{
  stm32_configgpio(GPIO_LCD_BACKLIGHT);
  stm32_gpiowrite(GPIO_LCD_BACKLIGHT, false);
  /* Remember the power off state */

  g_lcddev.power = 0;
  return OK;
}

/****************************************************************************
 * Name:  stm32f103_setpower
 *
 * Description:
 *   Enable/disable LCD panel power (0: full off - CONFIG_LCD_MAXPOWER:
 *   full on). On backlit LCDs, this setting may correspond to the backlight
 *   setting.
 *
 ****************************************************************************/

