dflhaishan/nuttx_os/boards/arm/stm32/stm32f103-alientek/src/stm32_lcd_5510.c
static int stm32f103_setpower(struct lcd_dev_s *dev, int power)
{
  ginfo("power: %d\n", power);

  /* Set new power level */

  if (power > 0)
    {
      /* Turn the backlight on */

      stm32_gpiowrite(GPIO_LCD_BACKLIGHT, true);
      /* Then turn the display on */
      g_lcddev.power = power;
    }
  else
    {
      /* Turn the display off */

      stm32f103_poweroff();
    }

  return OK;
}

/****************************************************************************
 * Name:  stm32f103_getcontrast
 *
 * Description:
 *   Get the current contrast setting (0-CONFIG_LCD_MAXCONTRAST).
 *
 ****************************************************************************/

static int stm32f103_getcontrast(struct lcd_dev_s *dev)
{
  ginfo("Not implemented\n");
  return -ENOSYS;
}

/****************************************************************************
 * Name:  stm32f103_setcontrast
 *
 * Description:
 *   Set LCD panel contrast (0-CONFIG_LCD_MAXCONTRAST).
 *
 ****************************************************************************/

static int stm32f103_setcontrast(struct lcd_dev_s *dev, unsigned int contrast)
{
  ginfo("contrast: %d\n", contrast);
  return -ENOSYS;
}

static inline void stm32f103_lcdinitialize(void)
{
    g_lcddev.type = LCD_TYPE_AL5510;
    ginfo("LCD Type: %d\n", g_lcddev.type);
    for (uint32_t i = 0; i < sizeof(lcd_cmd) / sizeof(lcd_cmd_t); i++)
    {
        LCD->address = lcd_cmd[i].cmd;
        LCD->value   = lcd_cmd[i].val;
    }
    
    LCD->address = LCD_REG_0;
    up_mdelay(120);
    LCD->address = LCD_REG_1;
    stm32_configgpio(GPIO_LCD_BACKLIGHT);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name:  board_lcd_initialize
 *
 * Description:
 *   Initialize the LCD video hardware.  The initial state of the LCD is
 *   fully initialized, display memory cleared, and the LCD ready to use,
 *   but with the power setting at 0 (full off).
 *
 ****************************************************************************/

int board_lcd_initialize(void)
{
  ginfo("Initializing\n");

  /* Register to receive power management callbacks */

  /* Configure GPIO pins and configure the FSMC to support the LCD */

  stm32_selectlcd();

  /* Configure and enable LCD */

  up_mdelay(50);
  stm32f103_lcdinitialize();

  /* Clear the display (setting it to the color 0=black) */

  stm32f103_lcdclear(0);

  /* Turn the backlight off */

  stm32f103_poweroff();
  return OK;
}

/****************************************************************************
 * Name:  board_lcd_getdev
 *
 * Description:
 *   Return a a reference to the LCD object for the specified LCD.  This
 *   allows support for multiple LCD devices.
 *
 ****************************************************************************/

struct lcd_dev_s *board_lcd_getdev(int lcddev)
{
  DEBUGASSERT(lcddev == 0);
  return &g_lcddev.dev;
}

/****************************************************************************
 * Name:  board_lcd_uninitialize
 *
 * Description:
 *   Uninitialize the LCD support
 *
 ****************************************************************************/

void board_lcd_uninitialize(void)
{
  stm32f103_poweroff();
  stm32_deselectlcd();
}

/****************************************************************************
 * Name:  stm32f103_lcdclear
 *
 * Description:
 *   This is a non-standard LCD interface just for the STM32F103-EVAL board.
 *   Because of the various rotations, clearing the display in the normal
 *   way by writing a sequences of runs that covers the entire display can
 *   be very slow.  Here the display is cleared by simply setting all GRAM
 *   memory to the specified color.
 *
 ****************************************************************************/

static void stm32f103_lcdclear(uint16_t color)
{
  uint32_t i = 0;

  stm32f103_setcursor(0, STM32F103_XRES - 1);
  for (i = 0; i < STM32F103_XRES * STM32F103_YRES; i++)
    {
      LCD->value = color;
    }
}
